# InitialLuminousIntensity Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialLuminousIntensity Class
Members See Also
---
This class encapsulates initial luminous intensity calculation.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class InitialLuminousIntensity : InitialIntensity
```

Visual Basic
---
```text
Public Class InitialLuminousIntensity _
	Inherits InitialIntensity
```

Visual C++
---
```text
public ref class InitialLuminousIntensity : public InitialIntensity
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..InitialIntensity Autodesk.Revit.DB.Lighting..::..InitialLuminousIntensity
# See Also
InitialLuminousIntensity Members
Autodesk.Revit.DB.Lighting Namespace